ELPasEDT/src/DataProcessors/СверткаИЗаменаСсылкокПоСобытиям/СверткаИЗаменаСсылкокПоСобытиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СверткаИЗаменаСсылкокПоСобытиям</name>
  <tabularSections>
    <name>ВсеСобытия</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеСобытия</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобытияКЗамене</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобытияКорректировки</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОсновногоСобытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобытиеОсновное</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ELPasEDT/src/Documents/ОперативныйЖурнал/ОперативныйЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперативныйЖурнал</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <basedOn>Document.ОперативныйЖурнал</basedOn>
  <registerRecords>InformationRegister.СобытияОперативногоЖурнала</registerRecords>
  <registerRecords>InformationRegister.СостояниеОборудования</registerRecords>
  <registerRecords>InformationRegister.АктивныеСмены</registerRecords>
  <registerRecords>InformationRegister.ОборудованиеНаКонтроле</registerRecords>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияИРаспоряжения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>CatalogRef.ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаОперативногоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗакрытия</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтаршийСмены</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоОт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаПрописью</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудованияДиспетчерское</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтданногоРаспоряжения</name>
    <type>
      <types>EnumRef.СтатусыОтданныхРаспоряжений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПерваяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистовик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мШаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОборудования</name>
      <type>
        <types>EnumRef.СтатусыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАктуален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыходаИзСтроя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтныхРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольВыполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеЗаписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиспетчерскоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОборудования</name>
      <type>
        <types>EnumRef.СостоянияОборудованияОЖ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроляЗнаний</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИРежимы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыИРежимы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСмены</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УдалитьПоказателиЧекЛиста</types>
        <types>CatalogRef.ПоказателиЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыДляОзнакомления</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.Журналы</types>
      </type>
    </attributes>
    <attributes>
      <name>КОзнакомлениюПринимающему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/DataProcessors/СверткаИЗаменаСсылкокПоСобытиям/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	События.ПометкаУдаления КАК ПометкаУдаления,
	|	События.Код КАК Код,
	|	События.Ссылка КАК Событие,
	|	События.Наименование КАК Наименование,
	|	События.Предопределенный КАК Предопределенный
	|ПОМЕСТИТЬ ВТ_Промежуточная
	|ИЗ
	|	Справочник.События КАК События
	|ГДЕ
	|	НЕ События.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Промежуточная.Код КАК Код,
	|	ВТ_Промежуточная.Событие КАК Событие,
	|	ВТ_Промежуточная.Наименование КАК Наименование,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Промежуточная1.Событие) КАК Номер,
	|	ВТ_Промежуточная.Предопределенный КАК Предопределенный
	|ПОМЕСТИТЬ ВТ_Подзапрос
	|ИЗ
	|	ВТ_Промежуточная КАК ВТ_Промежуточная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Промежуточная КАК ВТ_Промежуточная1
	|		ПО ВТ_Промежуточная.Наименование = ВТ_Промежуточная1.Наименование
	|			И ВТ_Промежуточная.Событие >= ВТ_Промежуточная1.Событие
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Промежуточная.Код,
	|	ВТ_Промежуточная.Событие,
	|	ВТ_Промежуточная.Наименование,
	|	ВТ_Промежуточная.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Подзапрос.Код КАК Код,
	|	ВТ_Подзапрос.Событие КАК Событие,
	|	ВТ_Подзапрос.Наименование КАК Наименование,
	|	ВТ_Подзапрос.Номер КАК Номер,
	|	ВТ_Подзапрос.Предопределенный КАК Предопределенный
	|ИЗ
	|	ВТ_Подзапрос КАК ВТ_Подзапрос
	|%ДопУсловие%
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Номер";
	
	ЗапросВсеСобытия = Новый Запрос;	
	ЗапросВсеСобытия.Текст = СтрЗаменить(ТекстЗапроса, "%ДопУсловие%", "");
	Объект.ВсеСобытия.Загрузить(ЗапросВсеСобытия.Выполнить().Выгрузить());
	
	ЗапросОсновныеСобытия = Новый Запрос;
	ЗапросОсновныеСобытия.Текст = СтрЗаменить(ТекстЗапроса, "%ДопУсловие%", "ГДЕ ВТ_Подзапрос.Номер = 1");
	Объект.ОсновныеСобытия.Загрузить(ЗапросОсновныеСобытия.Выполнить().Выгрузить());
	
	ЗапросСобытияКЗамене = Новый Запрос;
	ЗапросСобытияКЗамене.Текст = СтрЗаменить(ТекстЗапроса, "%ДопУсловие%", "ГДЕ ВТ_Подзапрос.Номер > 1");
	Объект.СобытияКЗамене.Загрузить(ЗапросСобытияКЗамене.Выполнить().Выгрузить()); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаменуСсылокНаСервере()
	
	НачатьТранзакцию();
	
	Для Каждого ТекСтр Из Объект.ОсновныеСобытия Цикл
		СтрокиОтбора = Объект.СобытияКЗамене.НайтиСтроки(Новый Структура("Наименование", ТекСтр.Наименование));
		Если СтрокиОтбора.Количество() > 0 Тогда
			мСсылки = Новый Массив;
			Для Каждого НайденнаяСтрока Из СтрокиОтбора Цикл
				мСсылки.Добавить(НайденнаяСтрока.Событие);
			КонецЦикла;
		Иначе
			Продолжить;
		КонецЕсли;
		НайденныеСсылки = НайтиПоСсылкам(мСсылки);
		ОсновноеСобытие = ТекСтр.Событие;	
		Если НайденныеСсылки.Количество() > 0 Тогда
			ЗаменаСсылокМетаданные(ОсновноеСобытие, НайденныеСсылки);
		КонецЕсли;
	КонецЦикла; 	
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаменаСсылокМетаданные(ОсновноеСобытие, НайденныеСсылки)
	
	Для Каждого Найденная Из НайденныеСсылки Цикл
		
		//Документы и Справочники
		Если Метаданные.Документы.Содержит(Найденная.Метаданные)
			Или Метаданные.Справочники.Содержит(Найденная.Метаданные) Тогда
			
			ОбъектДанных = Найденная.Данные.ПолучитьОбъект();
			
			//Универсальный
			//Для Каждого Рекв Из Найденная.Метаданные.Реквизиты Цикл
			//	Если ОбъектДанных[Рекв.Имя] = Найденная.Ссылка Тогда
			//		ОбъектДанных[Рекв.Имя] = ОсновноеСобытие;
			//	КонецЕсли;
			//КонецЦикла;
			Для Каждого Рекв Из Найденная.Метаданные.Реквизиты Цикл
				Если Рекв.Имя = "Событие" Тогда
					ОбъектДанных[Рекв.Имя] = ОсновноеСобытие;
				КонецЕсли;
			КонецЦикла;
			
			Если ТипЗнч(ОбъектДанных) = Тип("СправочникОбъект.ВидыЗаписей") Тогда
				ОбъектДанных["УдалитьСобытиеПоУмолчанию"] = ОсновноеСобытие;
			КонецЕсли;
			
			Если ТипЗнч(ОбъектДанных) = Тип("СправочникОбъект.События") Тогда
				Если ВРЕГ(СокрЛП(ОбъектДанных["СобытиеВЖурналеНСС"].Наименование)) = ВРЕГ(СокрЛП(ОсновноеСобытие.Наименование)) Тогда
					ОбъектДанных["СобытиеВЖурналеНСС"] = ОсновноеСобытие;
				КонецЕсли;
				Если ВРЕГ(СокрЛП(ОбъектДанных["СсылкаДляИзменения"].Наименование)) = ВРЕГ(СокрЛП(ОсновноеСобытие.Наименование)) Тогда
					ОбъектДанных["СсылкаДляИзменения"] = ОсновноеСобытие;
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого ТЧ Из Найденная.Метаданные.ТабличныеЧасти Цикл					
				Для Каждого Рекв ИЗ ТЧ.Реквизиты Цикл 						
					Для Каждого СтрТЧ Из ОбъектДанных[ТЧ.Имя] Цикл
						Если СтрТЧ[Рекв.Имя] = Найденная.Ссылка Тогда
							СтрТЧ[Рекв.Имя] = ОсновноеСобытие;
						КонецЕсли;
					КонецЦикла;						
				КонецЦикла; 					
			КонецЦикла;
			
			//ОбъектДанных.ОбменДанными.Загрузка = Истина;
			//Попытка
				ОбъектДанных.Записать();
			//Исключение
			//	Сообщить("Проблема с объектом " + ОбъектДанных);
			//КонецПопытки; 			
			
			//Регистры сведений	
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(Найденная.Метаданные) Тогда
			
			Набор = РегистрыСведений[Найденная.Метаданные.Имя].СоздатьНаборЗаписей();
			Если ТипЗнч(Набор) = Тип("РегистрСведенийНаборЗаписей.Заявки") Тогда
				Набор.Отбор["Ссылка"].Установить(Найденная.Данные["Ссылка"], Истина);
			ИначеЕсли ТипЗнч(Набор) = Тип("РегистрСведенийНаборЗаписей.ШаблоныТекстаЗаписейОЖ") Тогда
				Набор.Отбор["Событие"].Установить(Найденная.Данные["Событие"], Истина);
			КонецЕсли;
			Набор.Прочитать();
			Набор.Очистить();
			//Набор.ОбменДанными.Загрузка = Истина;
			Попытка
				Набор.Записать();
			Исключение
				Сообщить("Проблема с набором данных " + Набор);
			КонецПопытки;
			
			//Универсальный
			//Набор = РегистрыСведений[Найденная.Метаданные.Имя].СоздатьНаборЗаписей();
			//
			//Если Найденная.Метаданные.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			//	Набор.Отбор.Регистратор.Установить(Найденная.Данные.Регистратор, Истина);
			//	Набор.Отбор.НомерСтроки.Установить(Найденная.Данные.НомерСтроки, Истина);
			//Иначе
			//	Для Каждого Измер Из Найденная.Метаданные.Измерения Цикл
			//		Набор.Отбор[Измер.Имя].Установить(Найденная.Данные[Измер.Имя], Истина)
			//	КонецЦикла;
			//	Если Найденная.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			//		Набор.Отбор.Период.Установить(Найденная.Данные.Период, Истина);
			//	КонецЕсли;
			//КонецЕсли;
			//
			//Набор.Прочитать();
			//
			//Для Каждого ПолеТаб Из Найденная.Метаданные.Измерения Цикл
			//	Для Каждого Запись Из Набор Цикл
			//		Если Запись[ПолеТаб.Имя] = Найденная.Ссылка Тогда
			//			Запись[ПолеТаб.Имя] = ОсновноеСобытие;
			//		КонецЕсли;;
			//	КонецЦикла;
			//КонецЦикла;
			//
			//Для Каждого ПолеТаб Из Найденная.Метаданные.Ресурсы Цикл
			//	Для Каждого Запись Из Набор Цикл
			//		Если Запись[ПолеТаб.Имя] = Найденная.Ссылка Тогда
			//			Запись[ПолеТаб.Имя] = ОсновноеСобытие;
			//		КонецЕсли;;
			//	КонецЦикла;
			//КонецЦикла;
			//
			//Для Каждого ПолеТаб Из Найденная.Метаданные.Реквизиты Цикл
			//	Для Каждого Запись Из Набор Цикл
			//		Если Запись[ПолеТаб.Имя] = Найденная.Ссылка Тогда
			//			Запись[ПолеТаб.Имя] = ОсновноеСобытие;
			//		КонецЕсли;;
			//	КонецЦикла;
			//КонецЦикла;
			//
			//Набор.ОбменДанными.Загрузка = Истина;
			//Попытка
			//	Набор.Записать();
			//Исключение
			//	Сообщить("Проблема с набором данных " + Набор);
			//КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьЗаменуСсылок(Команда)
	ВыполнитьЗаменуСсылокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеЛишниеСобытияНаСервере()
	
	Для Каждого ТекСтр Из Объект.СобытияКЗамене Цикл
		ТекОбъект = ТекСтр.Событие.ПолучитьОбъект();
		ТекОбъект.ПометкаУдаления = Истина;
		Попытка
			ТекОбъект.Записать();
		Исключение
			Сообщить("Проблема с элементом " + ТекСтр.Событие + ", номер строки: " + ТекСтр.НомерСтроки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеЛишниеСобытия(Команда)
	ПометитьНаУдалениеЛишниеСобытияНаСервере();
	ПоказатьПредупреждение(, "Теперь нужно запустить Удаление помеченных объектов!!");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	События.Ссылка КАК Событие,
		|	События.Код КАК Код
		|ИЗ
		|	Справочник.События КАК События
		|ГДЕ
		|	События.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	События.Наименование";
	
	Объект.СобытияКорректировки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСсылкиНаСервере()
	
	НачатьТранзакцию();
	
	Для Каждого ТекСтр Из Объект.СобытияКорректировки Цикл 
		//ЗаменитьСобытиеОЖ(ТекСтр.Событие, ТекСтр.СобытиеОсновное)
		мСсылки = Новый Массив;
		мСсылки.Добавить(ТекСтр.Событие);
		НайденныеСсылки = НайтиПоСсылкам(мСсылки);
		Если НайденныеСсылки.Количество() > 0 Тогда
			ЗаменаСсылокМетаданные(ТекСтр.СобытиеОсновное, НайденныеСсылки);
		КонецЕсли;
	КонецЦикла; 	
	
	ЗафиксироватьТранзакцию();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСобытиеОЖ(СобытиеПоиска, СобытиеЗамены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперативныйЖурнал.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
		|ГДЕ
		|	ОперативныйЖурнал.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", СобытиеПоиска);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ДокОбъект = Результат.Ссылка.ПолучитьОбъект();
		ДокОбъект.Событие = СобытиеЗамены;
		Попытка
			ДокОбъект.Записать();
			Сообщить("Успешно " + ДокОбъект);
		Исключение
			Сообщить("Проблема с документом " + ДокОбъект);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСсылки(Команда)
	ЗаменитьСсылкиНаСервере();
	ПоказатьПредупреждение(, "Теперь нужно запустить Удаление помеченных объектов!!");
КонецПроцедуры

&НаСервере
Процедура ПодобратьПоНаименованиюНаСервере()
	
	Для Каждого ТекСтрока Из Объект.СобытияКорректировки Цикл
		ЗаполнитьСобытиеОсновное(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСобытиеОсновное(ТекСтрока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	События.Ссылка КАК Ссылка,
		|	События.Код КАК Код
		|ИЗ
		|	Справочник.События КАК События
		|ГДЕ
		|	НЕ События.ПометкаУдаления
		|	И События.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекСтрока.Событие.Наименование);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ТекСтрока.СобытиеОсновное = Результат.Ссылка;
		ТекСтрока.КодОсновногоСобытия = Результат.Код;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодобратьПоНаименованию(Команда)
	ПодобратьПоНаименованиюНаСервере();
КонецПроцедуры
